tgtakaoka/tinyos-msp430/tos/chips/msp430-small/gnugcc/msp430mcu.h
/*******************************************************************
*                                                                  *
* This file is a generic include file controlled by                *
* compiler/assembler IDE generated defines                         *
*                                                                  *
*******************************************************************/

#ifndef __msp430
#define __msp430


#if defined (__MSP430C111__)
#include "msp430c111.h"
#include "msp430c111_symbols.h"

#elif defined (__MSP430C1111__)
#include "msp430c1111.h"
#include "msp430c1111_symbols.h"

#elif defined (__MSP430C112__)
#include "msp430c112.h"
#include "msp430c112_symbols.h"

#elif defined (__MSP430C1121__)
#include "msp430c1121.h"
#include "msp430c1121_symbols.h"

#elif defined (__MSP430C1331__)
#include "msp430c1331.h"
#include "msp430c1331_symbols.h"

#elif defined (__MSP430C1351__)
#include "msp430c1351.h"
#include "msp430c1351_symbols.h"

#elif defined (__MSP430C311S__)
#include "msp430c311s.h"
#include "msp430c311s_symbols.h"

#elif defined (__MSP430C312__)
#include "msp430c312.h"
#include "msp430c312_symbols.h"

#elif defined (__MSP430C313__)
#include "msp430c313.h"
#include "msp430c313_symbols.h"

#elif defined (__MSP430C314__)
#include "msp430c314.h"
#include "msp430c314_symbols.h"

#elif defined (__MSP430C315__)
#include "msp430c315.h"
#include "msp430c315_symbols.h"

#elif defined (__MSP430C323__)
#include "msp430c323.h"
#include "msp430c323_symbols.h"

#elif defined (__MSP430C325__)
#include "msp430c325.h"
#include "msp430c325_symbols.h"

#elif defined (__MSP430C336__)
#include "msp430c336.h"
#include "msp430c336_symbols.h"

#elif defined (__MSP430C337__)
#include "msp430c337.h"
#include "msp430c337_symbols.h"

#elif defined (__MSP430C412__)
#include "msp430c412.h"
#include "msp430c412_symbols.h"

#elif defined (__MSP430C413__)
#include "msp430c413.h"
#include "msp430c413_symbols.h"

#elif defined (__MSP430CG4616__)
#include "msp430cg4616.h"
#include "msp430cg4616_symbols.h"

#elif defined (__MSP430CG4617__)
#include "msp430cg4617.h"
#include "msp430cg4617_symbols.h"

#elif defined (__MSP430CG4618__)
#include "msp430cg4618.h"
#include "msp430cg4618_symbols.h"

#elif defined (__MSP430CG4619__)
#include "msp430cg4619.h"
#include "msp430cg4619_symbols.h"

#elif defined (__MSP430E112__)
#include "msp430e112.h"
#include "msp430e112_symbols.h"

#elif defined (__MSP430E313__)
#include "msp430e313.h"
#include "msp430e313_symbols.h"

#elif defined (__MSP430E315__)
#include "msp430e315.h"
#include "msp430e315_symbols.h"

#elif defined (__MSP430E325__)
#include "msp430e325.h"
#include "msp430e325_symbols.h"

#elif defined (__MSP430E337__)
#include "msp430e337.h"
#include "msp430e337_symbols.h"

#elif defined (__MSP430F110__)
#include "msp430f110.h"
#include "msp430f110_symbols.h"

#elif defined (__MSP430F1101__)
#include "msp430f1101.h"
#include "msp430f1101_symbols.h"

#elif defined (__MSP430F1101A__)
#include "msp430f1101a.h"
#include "msp430f1101a_symbols.h"

#elif defined (__MSP430F1111__)
#include "msp430f1111.h"
#include "msp430f1111_symbols.h"

#elif defined (__MSP430F1111A__)
#include "msp430f1111a.h"
#include "msp430f1111a_symbols.h"

#elif defined (__MSP430F112__)
#include "msp430f112.h"
#include "msp430f112_symbols.h"

#elif defined (__MSP430F1121__)
#include "msp430f1121.h"
#include "msp430f1121_symbols.h"

#elif defined (__MSP430F1121A__)
#include "msp430f1121a.h"
#include "msp430f1121a_symbols.h"

#elif defined (__MSP430F1122__)
#include "msp430f1122.h"
#include "msp430f1122_symbols.h"

#elif defined (__MSP430F1132__)
#include "msp430f1132.h"
#include "msp430f1132_symbols.h"

#elif defined (__MSP430F122__)
#include "msp430f122.h"
#include "msp430f122_symbols.h"

#elif defined (__MSP430F1222__)
#include "msp430f1222.h"
#include "msp430f1222_symbols.h"

#elif defined (__MSP430F123__)
#include "msp430f123.h"
#include "msp430f123_symbols.h"

#elif defined (__MSP430F1232__)
#include "msp430f1232.h"
#include "msp430f1232_symbols.h"

#elif defined (__MSP430F133__)
#include "msp430f133.h"
#include "msp430f133_symbols.h"

#elif defined (__MSP430F135__)
#include "msp430f135.h"
#include "msp430f135_symbols.h"

#elif defined (__MSP430F147__)
#include "msp430f147.h"
#include "msp430f147_symbols.h"

#elif defined (__MSP430F148__)
#include "msp430f148.h"
#include "msp430f148_symbols.h"

#elif defined (__MSP430F149__)
#include "msp430f149.h"
#include "msp430f149_symbols.h"

#elif defined (__MSP430F1471__)
#include "msp430f1471.h"
#include "msp430f1471_symbols.h"

#elif defined (__MSP430F1481__)
#include "msp430f1481.h"
#include "msp430f1481_symbols.h"

#elif defined (__MSP430F1491__)
#include "msp430f1491.h"
#include "msp430f1491_symbols.h"

#elif defined (__MSP430F155__)
#include "msp430f155.h"
#include "msp430f155_symbols.h"

#elif defined (__MSP430F156__)
#include "msp430f156.h"
#include "msp430f156_symbols.h"

#elif defined (__MSP430F157__)
#include "msp430f157.h"
#include "msp430f157_symbols.h"

#elif defined (__MSP430F167__)
#include "msp430f167.h"
#include "msp430f167_symbols.h"

#elif defined (__MSP430F168__)
#include "msp430f168.h"
#include "msp430f168_symbols.h"

#elif defined (__MSP430F169__)
#include "msp430f169.h"
#include "msp430f169_symbols.h"

#elif defined (__MSP430F1610__)
#include "msp430f1610.h"
#include "msp430f1610_symbols.h"

#elif defined (__MSP430F1611__)
#include "msp430f1611.h"
#include "msp430f1611_symbols.h"

#elif defined (__MSP430F1612__)
#include "msp430f1612.h"
#include "msp430f1612_symbols.h"

#elif defined (__MSP430F2001__)
#include "msp430f2001.h"
#include "msp430f2001_symbols.h"

#elif defined (__MSP430F2011__)
#include "msp430f2011.h"
#include "msp430f2011_symbols.h"

#elif defined (__MSP430F2002__)
#include "msp430f2002.h"
#include "msp430f2002_symbols.h"

#elif defined (__MSP430F2012__)
#include "msp430f2012.h"
#include "msp430f2012_symbols.h"

#elif defined (__MSP430F2003__)
#include "msp430f2003.h"
#include "msp430f2003_symbols.h"

#elif defined (__MSP430F2013__)
#include "msp430f2013.h"
#include "msp430f2013_symbols.h"

