tgtakaoka/tinyos-msp430/tos/chips/msp430-small/gnugcc/msp430mcu.h
#elif defined (__MSP430F2101__)
#include "msp430f2101.h"
#include "msp430f2101_symbols.h"

#elif defined (__MSP430F2111__)
#include "msp430f2111.h"
#include "msp430f2111_symbols.h"

#elif defined (__MSP430F2121__)
#include "msp430f2121.h"
#include "msp430f2121_symbols.h"

#elif defined (__MSP430F2131__)
#include "msp430f2131.h"
#include "msp430f2131_symbols.h"

#elif defined (__MSP430F2112__)
#include "msp430f2112.h"
#include "msp430f2112_symbols.h"

#elif defined (__MSP430F2122__)
#include "msp430f2122.h"
#include "msp430f2122_symbols.h"

#elif defined (__MSP430F2132__)
#include "msp430f2132.h"
#include "msp430f2132_symbols.h"

#elif defined (__MSP430F2232__)
#include "msp430f2232.h"
#include "msp430f2232_symbols.h"

#elif defined (__MSP430F2252__)
#include "msp430f2252.h"
#include "msp430f2252_symbols.h"

#elif defined (__MSP430F2272__)
#include "msp430f2272.h"
#include "msp430f2272_symbols.h"

#elif defined (__MSP430F2234__)
#include "msp430f2234.h"
#include "msp430f2234_symbols.h"

#elif defined (__MSP430F2254__)
#include "msp430f2254.h"
#include "msp430f2254_symbols.h"

#elif defined (__MSP430F2274__)
#include "msp430f2274.h"
#include "msp430f2274_symbols.h"

#elif defined (__MSP430F2330__)
#include "msp430f2330.h"
#include "msp430f2330_symbols.h"

#elif defined (__MSP430F2350__)
#include "msp430f2350.h"
#include "msp430f2350_symbols.h"

#elif defined (__MSP430F2370__)
#include "msp430f2370.h"
#include "msp430f2370_symbols.h"

#elif defined (__MSP430F233__)
#include "msp430f233.h"
#include "msp430f233_symbols.h"

#elif defined (__MSP430F235__)
#include "msp430f235.h"
#include "msp430f235_symbols.h"

#elif defined (__MSP430F247__)
#include "msp430f247.h"
#include "msp430f247_symbols.h"

#elif defined (__MSP430F248__)
#include "msp430f248.h"
#include "msp430f248_symbols.h"

#elif defined (__MSP430F249__)
#include "msp430f249.h"
#include "msp430f249_symbols.h"

#elif defined (__MSP430F2410__)
#include "msp430f2410.h"
#include "msp430f2410_symbols.h"

#elif defined (__MSP430F2471__)
#include "msp430f2471.h"
#include "msp430f2471_symbols.h"

#elif defined (__MSP430F2481__)
#include "msp430f2481.h"
#include "msp430f2481_symbols.h"

#elif defined (__MSP430F2491__)
#include "msp430f2491.h"
#include "msp430f2491_symbols.h"

#elif defined (__MSP430F2416__)
#include "msp430f2416.h"
#include "msp430f2416_symbols.h"

#elif defined (__MSP430F2417__)
#include "msp430f2417.h"
#include "msp430f2417_symbols.h"

#elif defined (__MSP430F2418__)
#include "msp430f2418.h"
#include "msp430f2418_symbols.h"

#elif defined (__MSP430F2419__)
#include "msp430f2419.h"
#include "msp430f2419_symbols.h"

#elif defined (__MSP430F2616__)
#include "msp430f2616.h"
#include "msp430f2616_symbols.h"

#elif defined (__MSP430F2617__)
#include "msp430f2617.h"
#include "msp430f2617_symbols.h"

#elif defined (__MSP430F2618__)
#include "msp430f2618.h"
#include "msp430f2618_symbols.h"

#elif defined (__MSP430F2619__)
#include "msp430f2619.h"
#include "msp430f2619_symbols.h"

#elif defined (__MSP430F412__)
#include "msp430f412.h"
#include "msp430f412_symbols.h"

#elif defined (__MSP430F413__)
#include "msp430f413.h"
#include "msp430f413_symbols.h"

#elif defined (__MSP430F415__)
#include "msp430f415.h"
#include "msp430f415_symbols.h"

#elif defined (__MSP430F417__)
#include "msp430f417.h"
#include "msp430f417_symbols.h"

#elif defined (__MSP430F4132__)
#include "msp430f4132.h"
#include "msp430f4132_symbols.h"

#elif defined (__MSP430F4152__)
#include "msp430f4152.h"
#include "msp430f4152_symbols.h"

#elif defined (__MSP430F423__)
#include "msp430f423.h"
#include "msp430f423_symbols.h"

#elif defined (__MSP430F425__)
#include "msp430f425.h"
#include "msp430f425_symbols.h"

#elif defined (__MSP430F427__)
#include "msp430f427.h"
#include "msp430f427_symbols.h"

#elif defined (__MSP430F423A__)
#include "msp430f423a.h"
#include "msp430f423a_symbols.h"

#elif defined (__MSP430F425A__)
#include "msp430f425a.h"
#include "msp430f425a_symbols.h"

#elif defined (__MSP430F427A__)
#include "msp430f427a.h"
#include "msp430f427a_symbols.h"

#elif defined (__MSP430F435__)
#include "msp430f435.h"
#include "msp430f435_symbols.h"

#elif defined (__MSP430F436__)
#include "msp430f436.h"
#include "msp430f436_symbols.h"

#elif defined (__MSP430F437__)
#include "msp430f437.h"
#include "msp430f437_symbols.h"

#elif defined (__MSP430F4351__)
#include "msp430f4351.h"
#include "msp430f4351_symbols.h"

#elif defined (__MSP430F4361__)
#include "msp430f4361.h"
#include "msp430f4361_symbols.h"

#elif defined (__MSP430F4371__)
#include "msp430f4371.h"
#include "msp430f4371_symbols.h"

#elif defined (__MSP430F4481__)
#include "msp430f4481.h"
#include "msp430f4481_symbols.h"

#elif defined (__MSP430F4491__)
#include "msp430f4491.h"
#include "msp430f4491_symbols.h"

#elif defined (__MSP430F447__)
#include "msp430f447.h"
#include "msp430f447_symbols.h"

#elif defined (__MSP430F448__)
#include "msp430f448.h"
#include "msp430f448_symbols.h"

#elif defined (__MSP430F449__)
#include "msp430f449.h"
#include "msp430f449_symbols.h"

#elif defined (__MSP430FE423__)
#include "msp430fe423.h"
#include "msp430fe423_symbols.h"

#elif defined (__MSP430FE425__)
#include "msp430fe425.h"
#include "msp430fe425_symbols.h"

#elif defined (__MSP430FE427__)
#include "msp430fe427.h"
#include "msp430fe427_symbols.h"

#elif defined (__MSP430FE423A__)
#include "msp430fe423a.h"
#include "msp430fe423a_symbols.h"

#elif defined (__MSP430FE425A__)
#include "msp430fe425a.h"
#include "msp430fe425a_symbols.h"

#elif defined (__MSP430FE427A__)
#include "msp430fe427a.h"
#include "msp430fe427a_symbols.h"

#elif defined (__MSP430FE4232__)
#include "msp430fe4232.h"
#include "msp430fe4232_symbols.h"

#elif defined (__MSP430FE4242__)
#include "msp430fe4242.h"
#include "msp430fe4242_symbols.h"

#elif defined (__MSP430FE4252__)
#include "msp430fe4252.h"
#include "msp430fe4252_symbols.h"

#elif defined (__MSP430FE4272__)
#include "msp430fe4272.h"
#include "msp430fe4272_symbols.h"

#elif defined (__MSP430F4783__)
#include "msp430f4783.h"
#include "msp430f4783_symbols.h"

#elif defined (__MSP430F4793__)
#include "msp430f4793.h"
#include "msp430f4793_symbols.h"

