tgtakaoka/tinyos-msp430/tos/chips/msp430-small/gnugcc/msp430mcu.h
#elif defined (__MSP430F4784__)
#include "msp430f4784.h"
#include "msp430f4784_symbols.h"

#elif defined (__MSP430F4794__)
#include "msp430f4794.h"
#include "msp430f4794_symbols.h"

#elif defined (__MSP430F47126__)
#include "msp430f47126.h"
#include "msp430f47126_symbols.h"

#elif defined (__MSP430F47127__)
#include "msp430f47127.h"
#include "msp430f47127_symbols.h"

#elif defined (__MSP430F47163__)
#include "msp430f47163.h"
#include "msp430f47163_symbols.h"

#elif defined (__MSP430F47173__)
#include "msp430f47173.h"
#include "msp430f47173_symbols.h"

#elif defined (__MSP430F47183__)
#include "msp430f47183.h"
#include "msp430f47183_symbols.h"

#elif defined (__MSP430F47193__)
#include "msp430f47193.h"
#include "msp430f47193_symbols.h"

#elif defined (__MSP430F47166__)
#include "msp430f47166.h"
#include "msp430f47166_symbols.h"

#elif defined (__MSP430F47176__)
#include "msp430f47176.h"
#include "msp430f47176_symbols.h"

#elif defined (__MSP430F47186__)
#include "msp430f47186.h"
#include "msp430f47186_symbols.h"

#elif defined (__MSP430F47196__)
#include "msp430f47196.h"
#include "msp430f47196_symbols.h"

#elif defined (__MSP430F47167__)
#include "msp430f47167.h"
#include "msp430f47167_symbols.h"

#elif defined (__MSP430F47177__)
#include "msp430f47177.h"
#include "msp430f47177_symbols.h"

#elif defined (__MSP430F47187__)
#include "msp430f47187.h"
#include "msp430f47187_symbols.h"

#elif defined (__MSP430F47197__)
#include "msp430f47197.h"
#include "msp430f47197_symbols.h"

#elif defined (__MSP430F4250__)
#include "msp430f4250.h"
#include "msp430f4250_symbols.h"

#elif defined (__MSP430F4260__)
#include "msp430f4260.h"
#include "msp430f4260_symbols.h"

#elif defined (__MSP430F4270__)
#include "msp430f4270.h"
#include "msp430f4270_symbols.h"

#elif defined (__MSP430FG4250__)
#include "msp430fg4250.h"
#include "msp430fg4250_symbols.h"

#elif defined (__MSP430FG4260__)
#include "msp430fg4260.h"
#include "msp430fg4260_symbols.h"

#elif defined (__MSP430FG4270__)
#include "msp430fg4270.h"
#include "msp430fg4270_symbols.h"

#elif defined (__MSP430FW423__)
#include "msp430fw423.h"
#include "msp430fw423_symbols.h"

#elif defined (__MSP430FW425__)
#include "msp430fw425.h"
#include "msp430fw425_symbols.h"

#elif defined (__MSP430FW427__)
#include "msp430fw427.h"
#include "msp430fw427_symbols.h"

#elif defined (__MSP430FW428__)
#include "msp430fw428.h"
#include "msp430fw428_symbols.h"

#elif defined (__MSP430FW429__)
#include "msp430fw429.h"
#include "msp430fw429_symbols.h"

#elif defined (__MSP430FG437__)
#include "msp430fg437.h"
#include "msp430fg437_symbols.h"

#elif defined (__MSP430FG438__)
#include "msp430fg438.h"
#include "msp430fg438_symbols.h"

#elif defined (__MSP430FG439__)
#include "msp430fg439.h"
#include "msp430fg439_symbols.h"

#elif defined (__MSP430F438__)
#include "msp430f438.h"
#include "msp430f438_symbols.h"

#elif defined (__MSP430F439__)
#include "msp430f439.h"
#include "msp430f439_symbols.h"

#elif defined (__MSP430F477__)
#include "msp430f477.h"
#include "msp430f477_symbols.h"

#elif defined (__MSP430F478__)
#include "msp430f478.h"
#include "msp430f478_symbols.h"

#elif defined (__MSP430F479__)
#include "msp430f479.h"
#include "msp430f479_symbols.h"

#elif defined (__MSP430FG477__)
#include "msp430fg477.h"
#include "msp430fg477_symbols.h"

#elif defined (__MSP430FG478__)
#include "msp430fg478.h"
#include "msp430fg478_symbols.h"

#elif defined (__MSP430FG479__)
#include "msp430fg479.h"
#include "msp430fg479_symbols.h"

#elif defined (__MSP430F46161__)
#include "msp430f46161.h"
#include "msp430f46161_symbols.h"

#elif defined (__MSP430F46171__)
#include "msp430f46171.h"
#include "msp430f46171_symbols.h"

#elif defined (__MSP430F46181__)
#include "msp430f46181.h"
#include "msp430f46181_symbols.h"

#elif defined (__MSP430F46191__)
#include "msp430f46191.h"
#include "msp430f46191_symbols.h"

#elif defined (__MSP430F4616__)
#include "msp430f4616.h"
#include "msp430f4616_symbols.h"

#elif defined (__MSP430F4617__)
#include "msp430f4617.h"
#include "msp430f4617_symbols.h"

#elif defined (__MSP430F4618__)
#include "msp430f4618.h"
#include "msp430f4618_symbols.h"

#elif defined (__MSP430F4619__)
#include "msp430f4619.h"
#include "msp430f4619_symbols.h"

#elif defined (__MSP430FG4616__)
#include "msp430fg4616.h"
#include "msp430fg4616_symbols.h"

#elif defined (__MSP430FG4617__)
#include "msp430fg4617.h"
#include "msp430fg4617_symbols.h"

#elif defined (__MSP430FG4618__)
#include "msp430fg4618.h"
#include "msp430fg4618_symbols.h"

#elif defined (__MSP430FG4619__)
#include "msp430fg4619.h"
#include "msp430fg4619_symbols.h"

#elif defined (__MSP430F5418__)
#include "msp430f5418.h"
#include "msp430f5418_symbols.h"

#elif defined (__MSP430F5419__)
#include "msp430f5419.h"
#include "msp430f5419_symbols.h"

#elif defined (__MSP430F5435__)
#include "msp430f5435.h"
#include "msp430f5435_symbols.h"

#elif defined (__MSP430F5436__)
#include "msp430f5436.h"
#include "msp430f5436_symbols.h"

#elif defined (__MSP430F5437__)
#include "msp430f5437.h"
#include "msp430f5437_symbols.h"

#elif defined (__MSP430F5438__)
#include "msp430f5438.h"
#include "msp430f5438_symbols.h"

#elif defined (__MSP430F5418A__)
#include "msp430f5418a.h"
#include "msp430f5418a_symbols.h"

#elif defined (__MSP430F5419A__)
#include "msp430f5419a.h"
#include "msp430f5419a_symbols.h"

#elif defined (__MSP430F5435A__)
#include "msp430f5435a.h"
#include "msp430f5435a_symbols.h"

#elif defined (__MSP430F5436A__)
#include "msp430f5436a.h"
#include "msp430f5436a_symbols.h"

#elif defined (__MSP430F5437A__)
#include "msp430f5437a.h"
#include "msp430f5437a_symbols.h"

#elif defined (__MSP430F5438A__)
#include "msp430f5438a.h"
#include "msp430f5438a_symbols.h"

#elif defined (__MSP430F5212__)
#include "msp430f5212.h"
#include "msp430f5212_symbols.h"

#elif defined (__MSP430F5213__)
#include "msp430f5213.h"
#include "msp430f5213_symbols.h"

#elif defined (__MSP430F5214__)
#include "msp430f5214.h"
#include "msp430f5214_symbols.h"

