tgtakaoka/tinyos-msp430/tos/chips/msp430-small/gnugcc/msp430mcu.h
#elif defined (__MSP430F5217__)
#include "msp430f5217.h"
#include "msp430f5217_symbols.h"

#elif defined (__MSP430F5218__)
#include "msp430f5218.h"
#include "msp430f5218_symbols.h"

#elif defined (__MSP430F5219__)
#include "msp430f5219.h"
#include "msp430f5219_symbols.h"

#elif defined (__MSP430F5222__)
#include "msp430f5222.h"
#include "msp430f5222_symbols.h"

#elif defined (__MSP430F5223__)
#include "msp430f5223.h"
#include "msp430f5223_symbols.h"

#elif defined (__MSP430F5224__)
#include "msp430f5224.h"
#include "msp430f5224_symbols.h"

#elif defined (__MSP430F5227__)
#include "msp430f5227.h"
#include "msp430f5227_symbols.h"

#elif defined (__MSP430F5228__)
#include "msp430f5228.h"
#include "msp430f5228_symbols.h"

#elif defined (__MSP430F5229__)
#include "msp430f5229.h"
#include "msp430f5229_symbols.h"

#elif defined (__MSP430F5232__)
#include "msp430f5232.h"
#include "msp430f5232_symbols.h"

#elif defined (__MSP430F5234__)
#include "msp430f5234.h"
#include "msp430f5234_symbols.h"

#elif defined (__MSP430F5237__)
#include "msp430f5237.h"
#include "msp430f5237_symbols.h"

#elif defined (__MSP430F5239__)
#include "msp430f5239.h"
#include "msp430f5239_symbols.h"

#elif defined (__MSP430F5242__)
#include "msp430f5242.h"
#include "msp430f5242_symbols.h"

#elif defined (__MSP430F5244__)
#include "msp430f5244.h"
#include "msp430f5244_symbols.h"

#elif defined (__MSP430F5247__)
#include "msp430f5247.h"
#include "msp430f5247_symbols.h"

#elif defined (__MSP430F5249__)
#include "msp430f5249.h"
#include "msp430f5249_symbols.h"

#elif defined (__MSP430F5304__)
#include "msp430f5304.h"
#include "msp430f5304_symbols.h"

#elif defined (__MSP430F5308__)
#include "msp430f5308.h"
#include "msp430f5308_symbols.h"

#elif defined (__MSP430F5309__)
#include "msp430f5309.h"
#include "msp430f5309_symbols.h"

#elif defined (__MSP430F5310__)
#include "msp430f5310.h"
#include "msp430f5310_symbols.h"

#elif defined (__MSP430F5340__)
#include "msp430f5340.h"
#include "msp430f5340_symbols.h"

#elif defined (__MSP430F5341__)
#include "msp430f5341.h"
#include "msp430f5341_symbols.h"

#elif defined (__MSP430F5342__)
#include "msp430f5342.h"
#include "msp430f5342_symbols.h"

#elif defined (__MSP430F5324__)
#include "msp430f5324.h"
#include "msp430f5324_symbols.h"

#elif defined (__MSP430F5325__)
#include "msp430f5325.h"
#include "msp430f5325_symbols.h"

#elif defined (__MSP430F5326__)
#include "msp430f5326.h"
#include "msp430f5326_symbols.h"

#elif defined (__MSP430F5327__)
#include "msp430f5327.h"
#include "msp430f5327_symbols.h"

#elif defined (__MSP430F5328__)
#include "msp430f5328.h"
#include "msp430f5328_symbols.h"

#elif defined (__MSP430F5329__)
#include "msp430f5329.h"
#include "msp430f5329_symbols.h"

#elif defined (__MSP430F5500__)
#include "msp430f5500.h"
#include "msp430f5500_symbols.h"

#elif defined (__MSP430F5501__)
#include "msp430f5501.h"
#include "msp430f5501_symbols.h"

#elif defined (__MSP430F5502__)
#include "msp430f5502.h"
#include "msp430f5502_symbols.h"

#elif defined (__MSP430F5503__)
#include "msp430f5503.h"
#include "msp430f5503_symbols.h"

#elif defined (__MSP430F5504__)
#include "msp430f5504.h"
#include "msp430f5504_symbols.h"

#elif defined (__MSP430F5505__)
#include "msp430f5505.h"
#include "msp430f5505_symbols.h"

#elif defined (__MSP430F5506__)
#include "msp430f5506.h"
#include "msp430f5506_symbols.h"

#elif defined (__MSP430F5507__)
#include "msp430f5507.h"
#include "msp430f5507_symbols.h"

#elif defined (__MSP430F5508__)
#include "msp430f5508.h"
#include "msp430f5508_symbols.h"

#elif defined (__MSP430F5509__)
#include "msp430f5509.h"
#include "msp430f5509_symbols.h"

#elif defined (__MSP430F5510__)
#include "msp430f5510.h"
#include "msp430f5510_symbols.h"

#elif defined (__MSP430F5513__)
#include "msp430f5513.h"
#include "msp430f5513_symbols.h"

#elif defined (__MSP430F5514__)
#include "msp430f5514.h"
#include "msp430f5514_symbols.h"

#elif defined (__MSP430F5515__)
#include "msp430f5515.h"
#include "msp430f5515_symbols.h"

#elif defined (__MSP430F5517__)
#include "msp430f5517.h"
#include "msp430f5517_symbols.h"

#elif defined (__MSP430F5519__)
#include "msp430f5519.h"
#include "msp430f5519_symbols.h"

#elif defined (__MSP430F5521__)
#include "msp430f5521.h"
#include "msp430f5521_symbols.h"

#elif defined (__MSP430F5522__)
#include "msp430f5522.h"
#include "msp430f5522_symbols.h"

#elif defined (__MSP430F5524__)
#include "msp430f5524.h"
#include "msp430f5524_symbols.h"

#elif defined (__MSP430F5525__)
#include "msp430f5525.h"
#include "msp430f5525_symbols.h"

#elif defined (__MSP430F5526__)
#include "msp430f5526.h"
#include "msp430f5526_symbols.h"

#elif defined (__MSP430F5527__)
#include "msp430f5527.h"
#include "msp430f5527_symbols.h"

#elif defined (__MSP430F5528__)
#include "msp430f5528.h"
#include "msp430f5528_symbols.h"

#elif defined (__MSP430F5529__)
#include "msp430f5529.h"
#include "msp430f5529_symbols.h"

#elif defined (__MSP430P112__)
#include "msp430p112.h"
#include "msp430p112_symbols.h"

#elif defined (__MSP430P313__)
#include "msp430p313.h"
#include "msp430p313_symbols.h"

#elif defined (__MSP430P315__)
#include "msp430p315.h"
#include "msp430p315_symbols.h"

#elif defined (__MSP430P315S__)
#include "msp430p315s.h"
#include "msp430p315s_symbols.h"

#elif defined (__MSP430P325__)
#include "msp430p325.h"
#include "msp430p325_symbols.h"

#elif defined (__MSP430P337__)
#include "msp430p337.h"
#include "msp430p337_symbols.h"

#elif defined (__CC430F5133__)
#include "cc430f5133.h"
#include "cc430f5133_symbols.h"

#elif defined (__CC430F5135__)
#include "cc430f5135.h"
#include "cc430f5135_symbols.h"

#elif defined (__CC430F5137__)
#include "cc430f5137.h"
#include "cc430f5137_symbols.h"

#elif defined (__CC430F6125__)
#include "cc430f6125.h"
#include "cc430f6125_symbols.h"

#elif defined (__CC430F6126__)
#include "cc430f6126.h"
#include "cc430f6126_symbols.h"

#elif defined (__CC430F6127__)
#include "cc430f6127.h"
#include "cc430f6127_symbols.h"

