tgtakaoka/tinyos-msp430/tos/chips/msp430-small/gnugcc/msp430mcu.h
#elif defined (__CC430F6135__)
#include "cc430f6135.h"
#include "cc430f6135_symbols.h"

#elif defined (__CC430F6137__)
#include "cc430f6137.h"
#include "cc430f6137_symbols.h"

#elif defined (__CC430F5123__)
#include "cc430f5123.h"
#include "cc430f5123_symbols.h"

#elif defined (__CC430F5125__)
#include "cc430f5125.h"
#include "cc430f5125_symbols.h"

#elif defined (__CC430F5143__)
#include "cc430f5143.h"
#include "cc430f5143_symbols.h"

#elif defined (__CC430F5145__)
#include "cc430f5145.h"
#include "cc430f5145_symbols.h"

#elif defined (__CC430F5147__)
#include "cc430f5147.h"
#include "cc430f5147_symbols.h"

#elif defined (__CC430F6143__)
#include "cc430f6143.h"
#include "cc430f6143_symbols.h"

#elif defined (__CC430F6145__)
#include "cc430f6145.h"
#include "cc430f6145_symbols.h"

#elif defined (__CC430F6147__)
#include "cc430f6147.h"
#include "cc430f6147_symbols.h"

#elif defined (__MSP430F5333__)
#include "msp430f5333.h"
#include "msp430f5333_symbols.h"

#elif defined (__MSP430F5335__)
#include "msp430f5335.h"
#include "msp430f5335_symbols.h"

#elif defined (__MSP430F5336__)
#include "msp430f5336.h"
#include "msp430f5336_symbols.h"

#elif defined (__MSP430F5338__)
#include "msp430f5338.h"
#include "msp430f5338_symbols.h"

#elif defined (__MSP430F5630__)
#include "msp430f5630.h"
#include "msp430f5630_symbols.h"

#elif defined (__MSP430F5631__)
#include "msp430f5631.h"
#include "msp430f5631_symbols.h"

#elif defined (__MSP430F5632__)
#include "msp430f5632.h"
#include "msp430f5632_symbols.h"

#elif defined (__MSP430F5633__)
#include "msp430f5633.h"
#include "msp430f5633_symbols.h"

#elif defined (__MSP430F5634__)
#include "msp430f5634.h"
#include "msp430f5634_symbols.h"

#elif defined (__MSP430F5635__)
#include "msp430f5635.h"
#include "msp430f5635_symbols.h"

#elif defined (__MSP430F5636__)
#include "msp430f5636.h"
#include "msp430f5636_symbols.h"

#elif defined (__MSP430F5637__)
#include "msp430f5637.h"
#include "msp430f5637_symbols.h"

#elif defined (__MSP430F5638__)
#include "msp430f5638.h"
#include "msp430f5638_symbols.h"

#elif defined (__MSP430F6433__)
#include "msp430f6433.h"
#include "msp430f6433_symbols.h"

#elif defined (__MSP430F6435__)
#include "msp430f6435.h"
#include "msp430f6435_symbols.h"

#elif defined (__MSP430F6436__)
#include "msp430f6436.h"
#include "msp430f6436_symbols.h"

#elif defined (__MSP430F6438__)
#include "msp430f6438.h"
#include "msp430f6438_symbols.h"

#elif defined (__MSP430F6630__)
#include "msp430f6630.h"
#include "msp430f6630_symbols.h"

#elif defined (__MSP430F6631__)
#include "msp430f6631.h"
#include "msp430f6631_symbols.h"

#elif defined (__MSP430F6632__)
#include "msp430f6632.h"
#include "msp430f6632_symbols.h"

#elif defined (__MSP430F6633__)
#include "msp430f6633.h"
#include "msp430f6633_symbols.h"

#elif defined (__MSP430F6634__)
#include "msp430f6634.h"
#include "msp430f6634_symbols.h"

#elif defined (__MSP430F6635__)
#include "msp430f6635.h"
#include "msp430f6635_symbols.h"

#elif defined (__MSP430F6636__)
#include "msp430f6636.h"
#include "msp430f6636_symbols.h"

#elif defined (__MSP430F6637__)
#include "msp430f6637.h"
#include "msp430f6637_symbols.h"

#elif defined (__MSP430F6638__)
#include "msp430f6638.h"
#include "msp430f6638_symbols.h"

#elif defined (__MSP430F5358__)
#include "msp430f5358.h"
#include "msp430f5358_symbols.h"

#elif defined (__MSP430F5359__)
#include "msp430f5359.h"
#include "msp430f5359_symbols.h"

#elif defined (__MSP430F5658__)
#include "msp430f5658.h"
#include "msp430f5658_symbols.h"

#elif defined (__MSP430F5659__)
#include "msp430f5659.h"
#include "msp430f5659_symbols.h"

#elif defined (__MSP430F6458__)
#include "msp430f6458.h"
#include "msp430f6458_symbols.h"

#elif defined (__MSP430F6459__)
#include "msp430f6459.h"
#include "msp430f6459_symbols.h"

#elif defined (__MSP430F6658__)
#include "msp430f6658.h"
#include "msp430f6658_symbols.h"

#elif defined (__MSP430F6659__)
#include "msp430f6659.h"
#include "msp430f6659_symbols.h"

#elif defined (__MSP430FG6425__)
#include "msp430fg6425.h"
#include "msp430fg6425_symbols.h"

#elif defined (__MSP430FG6426__)
#include "msp430fg6426.h"
#include "msp430fg6426_symbols.h"

#elif defined (__MSP430FG6625__)
#include "msp430fg6625.h"
#include "msp430fg6625_symbols.h"

#elif defined (__MSP430FG6626__)
#include "msp430fg6626.h"
#include "msp430fg6626_symbols.h"

#elif defined (__MSP430L092__)
#include "msp430l092.h"
#include "msp430l092_symbols.h"

#elif defined (__MSP430C091__)
#include "msp430c091.h"
#include "msp430c091_symbols.h"

#elif defined (__MSP430C092__)
#include "msp430c092.h"
#include "msp430c092_symbols.h"

#elif defined (__MSP430F5131__)
#include "msp430f5131.h"
#include "msp430f5131_symbols.h"

#elif defined (__MSP430F5151__)
#include "msp430f5151.h"
#include "msp430f5151_symbols.h"

#elif defined (__MSP430F5171__)
#include "msp430f5171.h"
#include "msp430f5171_symbols.h"

#elif defined (__MSP430F5132__)
#include "msp430f5132.h"
#include "msp430f5132_symbols.h"

#elif defined (__MSP430F5152__)
#include "msp430f5152.h"
#include "msp430f5152_symbols.h"

#elif defined (__MSP430F5172__)
#include "msp430f5172.h"
#include "msp430f5172_symbols.h"

#elif defined (__MSP430F6720__)
#include "msp430f6720.h"
#include "msp430f6720_symbols.h"

#elif defined (__MSP430F6721__)
#include "msp430f6721.h"
#include "msp430f6721_symbols.h"

#elif defined (__MSP430F6723__)
#include "msp430f6723.h"
#include "msp430f6723_symbols.h"

#elif defined (__MSP430F6724__)
#include "msp430f6724.h"
#include "msp430f6724_symbols.h"

#elif defined (__MSP430F6725__)
#include "msp430f6725.h"
#include "msp430f6725_symbols.h"

#elif defined (__MSP430F6726__)
#include "msp430f6726.h"
#include "msp430f6726_symbols.h"

#elif defined (__MSP430F6730__)
#include "msp430f6730.h"
#include "msp430f6730_symbols.h"

#elif defined (__MSP430F6731__)
#include "msp430f6731.h"
#include "msp430f6731_symbols.h"

#elif defined (__MSP430F6733__)
#include "msp430f6733.h"
#include "msp430f6733_symbols.h"

