tgtakaoka/tinyos-msp430/tos/chips/msp430-small/gnugcc/msp430mcu.h
#elif defined (__MSP430F6734__)
#include "msp430f6734.h"
#include "msp430f6734_symbols.h"

#elif defined (__MSP430F6735__)
#include "msp430f6735.h"
#include "msp430f6735_symbols.h"

#elif defined (__MSP430F6736__)
#include "msp430f6736.h"
#include "msp430f6736_symbols.h"

#elif defined (__MSP430F67621__)
#include "msp430f67621.h"
#include "msp430f67621_symbols.h"

#elif defined (__MSP430F67641__)
#include "msp430f67641.h"
#include "msp430f67641_symbols.h"

#elif defined (__MSP430F6720A__)
#include "msp430f6720a.h"
#include "msp430f6720a_symbols.h"

#elif defined (__MSP430F6721A__)
#include "msp430f6721a.h"
#include "msp430f6721a_symbols.h"

#elif defined (__MSP430F6723A__)
#include "msp430f6723a.h"
#include "msp430f6723a_symbols.h"

#elif defined (__MSP430F6724A__)
#include "msp430f6724a.h"
#include "msp430f6724a_symbols.h"

#elif defined (__MSP430F6725A__)
#include "msp430f6725a.h"
#include "msp430f6725a_symbols.h"

#elif defined (__MSP430F6726A__)
#include "msp430f6726a.h"
#include "msp430f6726a_symbols.h"

#elif defined (__MSP430F6730A__)
#include "msp430f6730a.h"
#include "msp430f6730a_symbols.h"

#elif defined (__MSP430F6731A__)
#include "msp430f6731a.h"
#include "msp430f6731a_symbols.h"

#elif defined (__MSP430F6733A__)
#include "msp430f6733a.h"
#include "msp430f6733a_symbols.h"

#elif defined (__MSP430F6734A__)
#include "msp430f6734a.h"
#include "msp430f6734a_symbols.h"

#elif defined (__MSP430F6735A__)
#include "msp430f6735a.h"
#include "msp430f6735a_symbols.h"

#elif defined (__MSP430F6736A__)
#include "msp430f6736a.h"
#include "msp430f6736a_symbols.h"

#elif defined (__MSP430F67621A__)
#include "msp430f67621a.h"
#include "msp430f67621a_symbols.h"

#elif defined (__MSP430F67641A__)
#include "msp430f67641a.h"
#include "msp430f67641a_symbols.h"

#elif defined (__MSP430F67451__)
#include "msp430f67451.h"
#include "msp430f67451_symbols.h"

#elif defined (__MSP430F67651__)
#include "msp430f67651.h"
#include "msp430f67651_symbols.h"

#elif defined (__MSP430F67751__)
#include "msp430f67751.h"
#include "msp430f67751_symbols.h"

#elif defined (__MSP430F67461__)
#include "msp430f67461.h"
#include "msp430f67461_symbols.h"

#elif defined (__MSP430F67661__)
#include "msp430f67661.h"
#include "msp430f67661_symbols.h"

#elif defined (__MSP430F67761__)
#include "msp430f67761.h"
#include "msp430f67761_symbols.h"

#elif defined (__MSP430F67471__)
#include "msp430f67471.h"
#include "msp430f67471_symbols.h"

#elif defined (__MSP430F67671__)
#include "msp430f67671.h"
#include "msp430f67671_symbols.h"

#elif defined (__MSP430F67771__)
#include "msp430f67771.h"
#include "msp430f67771_symbols.h"

#elif defined (__MSP430F67481__)
#include "msp430f67481.h"
#include "msp430f67481_symbols.h"

#elif defined (__MSP430F67681__)
#include "msp430f67681.h"
#include "msp430f67681_symbols.h"

#elif defined (__MSP430F67781__)
#include "msp430f67781.h"
#include "msp430f67781_symbols.h"

#elif defined (__MSP430F67491__)
#include "msp430f67491.h"
#include "msp430f67491_symbols.h"

#elif defined (__MSP430F67691__)
#include "msp430f67691.h"
#include "msp430f67691_symbols.h"

#elif defined (__MSP430F67791__)
#include "msp430f67791.h"
#include "msp430f67791_symbols.h"

#elif defined (__MSP430F6745__)
#include "msp430f6745.h"
#include "msp430f6745_symbols.h"

#elif defined (__MSP430F6765__)
#include "msp430f6765.h"
#include "msp430f6765_symbols.h"

#elif defined (__MSP430F6775__)
#include "msp430f6775.h"
#include "msp430f6775_symbols.h"

#elif defined (__MSP430F6746__)
#include "msp430f6746.h"
#include "msp430f6746_symbols.h"

#elif defined (__MSP430F6766__)
#include "msp430f6766.h"
#include "msp430f6766_symbols.h"

#elif defined (__MSP430F6776__)
#include "msp430f6776.h"
#include "msp430f6776_symbols.h"

#elif defined (__MSP430F6747__)
#include "msp430f6747.h"
#include "msp430f6747_symbols.h"

#elif defined (__MSP430F6767__)
#include "msp430f6767.h"
#include "msp430f6767_symbols.h"

#elif defined (__MSP430F6777__)
#include "msp430f6777.h"
#include "msp430f6777_symbols.h"

#elif defined (__MSP430F6748__)
#include "msp430f6748.h"
#include "msp430f6748_symbols.h"

#elif defined (__MSP430F6768__)
#include "msp430f6768.h"
#include "msp430f6768_symbols.h"

#elif defined (__MSP430F6778__)
#include "msp430f6778.h"
#include "msp430f6778_symbols.h"

#elif defined (__MSP430F6749__)
#include "msp430f6749.h"
#include "msp430f6749_symbols.h"

#elif defined (__MSP430F6769__)
#include "msp430f6769.h"
#include "msp430f6769_symbols.h"

#elif defined (__MSP430F6779__)
#include "msp430f6779.h"
#include "msp430f6779_symbols.h"

#elif defined (__MSP430F67451A__)
#include "msp430f67451a.h"
#include "msp430f67451a_symbols.h"

#elif defined (__MSP430F67651A__)
#include "msp430f67651a.h"
#include "msp430f67651a_symbols.h"

#elif defined (__MSP430F67751A__)
#include "msp430f67751a.h"
#include "msp430f67751a_symbols.h"

#elif defined (__MSP430F67461A__)
#include "msp430f67461a.h"
#include "msp430f67461a_symbols.h"

#elif defined (__MSP430F67661A__)
#include "msp430f67661a.h"
#include "msp430f67661a_symbols.h"

#elif defined (__MSP430F67761A__)
#include "msp430f67761a.h"
#include "msp430f67761a_symbols.h"

#elif defined (__MSP430F67471A__)
#include "msp430f67471a.h"
#include "msp430f67471a_symbols.h"

#elif defined (__MSP430F67671A__)
#include "msp430f67671a.h"
#include "msp430f67671a_symbols.h"

#elif defined (__MSP430F67771A__)
#include "msp430f67771a.h"
#include "msp430f67771a_symbols.h"

#elif defined (__MSP430F67481A__)
#include "msp430f67481a.h"
#include "msp430f67481a_symbols.h"

#elif defined (__MSP430F67681A__)
#include "msp430f67681a.h"
#include "msp430f67681a_symbols.h"

#elif defined (__MSP430F67781A__)
#include "msp430f67781a.h"
#include "msp430f67781a_symbols.h"

#elif defined (__MSP430F67491A__)
#include "msp430f67491a.h"
#include "msp430f67491a_symbols.h"

#elif defined (__MSP430F67691A__)
#include "msp430f67691a.h"
#include "msp430f67691a_symbols.h"

#elif defined (__MSP430F67791A__)
#include "msp430f67791a.h"
#include "msp430f67791a_symbols.h"

#elif defined (__MSP430F6745A__)
#include "msp430f6745a.h"
#include "msp430f6745a_symbols.h"

