tgtakaoka/tinyos-msp430/tos/chips/msp430-small/gnugcc/msp430mcu.h
#elif defined (__MSP430F6765A__)
#include "msp430f6765a.h"
#include "msp430f6765a_symbols.h"

#elif defined (__MSP430F6775A__)
#include "msp430f6775a.h"
#include "msp430f6775a_symbols.h"

#elif defined (__MSP430F6746A__)
#include "msp430f6746a.h"
#include "msp430f6746a_symbols.h"

#elif defined (__MSP430F6766A__)
#include "msp430f6766a.h"
#include "msp430f6766a_symbols.h"

#elif defined (__MSP430F6776A__)
#include "msp430f6776a.h"
#include "msp430f6776a_symbols.h"

#elif defined (__MSP430F6747A__)
#include "msp430f6747a.h"
#include "msp430f6747a_symbols.h"

#elif defined (__MSP430F6767A__)
#include "msp430f6767a.h"
#include "msp430f6767a_symbols.h"

#elif defined (__MSP430F6777A__)
#include "msp430f6777a.h"
#include "msp430f6777a_symbols.h"

#elif defined (__MSP430F6748A__)
#include "msp430f6748a.h"
#include "msp430f6748a_symbols.h"

#elif defined (__MSP430F6768A__)
#include "msp430f6768a.h"
#include "msp430f6768a_symbols.h"

#elif defined (__MSP430F6778A__)
#include "msp430f6778a.h"
#include "msp430f6778a_symbols.h"

#elif defined (__MSP430F6749A__)
#include "msp430f6749a.h"
#include "msp430f6749a_symbols.h"

#elif defined (__MSP430F6769A__)
#include "msp430f6769a.h"
#include "msp430f6769a_symbols.h"

#elif defined (__MSP430F6779A__)
#include "msp430f6779a.h"
#include "msp430f6779a_symbols.h"

#elif defined (__MSP430FR5720__)
#include "msp430fr5720.h"
#include "msp430fr5720_symbols.h"

#elif defined (__MSP430FR5721__)
#include "msp430fr5721.h"
#include "msp430fr5721_symbols.h"

#elif defined (__MSP430FR5722__)
#include "msp430fr5722.h"
#include "msp430fr5722_symbols.h"

#elif defined (__MSP430FR5723__)
#include "msp430fr5723.h"
#include "msp430fr5723_symbols.h"

#elif defined (__MSP430FR5724__)
#include "msp430fr5724.h"
#include "msp430fr5724_symbols.h"

#elif defined (__MSP430FR5725__)
#include "msp430fr5725.h"
#include "msp430fr5725_symbols.h"

#elif defined (__MSP430FR5726__)
#include "msp430fr5726.h"
#include "msp430fr5726_symbols.h"

#elif defined (__MSP430FR5727__)
#include "msp430fr5727.h"
#include "msp430fr5727_symbols.h"

#elif defined (__MSP430FR5728__)
#include "msp430fr5728.h"
#include "msp430fr5728_symbols.h"

#elif defined (__MSP430FR5729__)
#include "msp430fr5729.h"
#include "msp430fr5729_symbols.h"

#elif defined (__MSP430FR5730__)
#include "msp430fr5730.h"
#include "msp430fr5730_symbols.h"

#elif defined (__MSP430FR5731__)
#include "msp430fr5731.h"
#include "msp430fr5731_symbols.h"

#elif defined (__MSP430FR5732__)
#include "msp430fr5732.h"
#include "msp430fr5732_symbols.h"

#elif defined (__MSP430FR5733__)
#include "msp430fr5733.h"
#include "msp430fr5733_symbols.h"

#elif defined (__MSP430FR5734__)
#include "msp430fr5734.h"
#include "msp430fr5734_symbols.h"

#elif defined (__MSP430FR5735__)
#include "msp430fr5735.h"
#include "msp430fr5735_symbols.h"

#elif defined (__MSP430FR5736__)
#include "msp430fr5736.h"
#include "msp430fr5736_symbols.h"

#elif defined (__MSP430FR5737__)
#include "msp430fr5737.h"
#include "msp430fr5737_symbols.h"

#elif defined (__MSP430FR5738__)
#include "msp430fr5738.h"
#include "msp430fr5738_symbols.h"

#elif defined (__MSP430FR5739__)
#include "msp430fr5739.h"
#include "msp430fr5739_symbols.h"

#elif defined (__MSP430G2211__)
#include "msp430g2211.h"
#include "msp430g2211_symbols.h"

#elif defined (__MSP430G2201__)
#include "msp430g2201.h"
#include "msp430g2201_symbols.h"

#elif defined (__MSP430G2111__)
#include "msp430g2111.h"
#include "msp430g2111_symbols.h"

#elif defined (__MSP430G2101__)
#include "msp430g2101.h"
#include "msp430g2101_symbols.h"

#elif defined (__MSP430G2001__)
#include "msp430g2001.h"
#include "msp430g2001_symbols.h"

#elif defined (__MSP430G2231__)
#include "msp430g2231.h"
#include "msp430g2231_symbols.h"

#elif defined (__MSP430G2221__)
#include "msp430g2221.h"
#include "msp430g2221_symbols.h"

#elif defined (__MSP430G2131__)
#include "msp430g2131.h"
#include "msp430g2131_symbols.h"

#elif defined (__MSP430G2121__)
#include "msp430g2121.h"
#include "msp430g2121_symbols.h"

#elif defined (__MSP430AFE221__)
#include "msp430afe221.h"
#include "msp430afe221_symbols.h"

#elif defined (__MSP430AFE231__)
#include "msp430afe231.h"
#include "msp430afe231_symbols.h"

#elif defined (__MSP430AFE251__)
#include "msp430afe251.h"
#include "msp430afe251_symbols.h"

#elif defined (__MSP430AFE222__)
#include "msp430afe222.h"
#include "msp430afe222_symbols.h"

#elif defined (__MSP430AFE232__)
#include "msp430afe232.h"
#include "msp430afe232_symbols.h"

#elif defined (__MSP430AFE252__)
#include "msp430afe252.h"
#include "msp430afe252_symbols.h"

#elif defined (__MSP430AFE223__)
#include "msp430afe223.h"
#include "msp430afe223_symbols.h"

#elif defined (__MSP430AFE233__)
#include "msp430afe233.h"
#include "msp430afe233_symbols.h"

#elif defined (__MSP430AFE253__)
#include "msp430afe253.h"
#include "msp430afe253_symbols.h"

#elif defined (__MSP430G2102__)
#include "msp430g2102.h"
#include "msp430g2102_symbols.h"

#elif defined (__MSP430G2202__)
#include "msp430g2202.h"
#include "msp430g2202_symbols.h"

#elif defined (__MSP430G2302__)
#include "msp430g2302.h"
#include "msp430g2302_symbols.h"

#elif defined (__MSP430G2402__)
#include "msp430g2402.h"
#include "msp430g2402_symbols.h"

#elif defined (__MSP430G2132__)
#include "msp430g2132.h"
#include "msp430g2132_symbols.h"

#elif defined (__MSP430G2232__)
#include "msp430g2232.h"
#include "msp430g2232_symbols.h"

#elif defined (__MSP430G2332__)
#include "msp430g2332.h"
#include "msp430g2332_symbols.h"

#elif defined (__MSP430G2432__)
#include "msp430g2432.h"
#include "msp430g2432_symbols.h"

#elif defined (__MSP430G2112__)
#include "msp430g2112.h"
#include "msp430g2112_symbols.h"

#elif defined (__MSP430G2212__)
#include "msp430g2212.h"
#include "msp430g2212_symbols.h"

#elif defined (__MSP430G2312__)
#include "msp430g2312.h"
#include "msp430g2312_symbols.h"

#elif defined (__MSP430G2412__)
#include "msp430g2412.h"
#include "msp430g2412_symbols.h"

