tgtakaoka/tinyos-msp430/tos/chips/msp430-small/gnugcc/msp430mcu.h
#elif defined (__MSP430G2152__)
#include "msp430g2152.h"
#include "msp430g2152_symbols.h"

#elif defined (__MSP430G2252__)
#include "msp430g2252.h"
#include "msp430g2252_symbols.h"

#elif defined (__MSP430G2352__)
#include "msp430g2352.h"
#include "msp430g2352_symbols.h"

#elif defined (__MSP430G2452__)
#include "msp430g2452.h"
#include "msp430g2452_symbols.h"

#elif defined (__MSP430G2113__)
#include "msp430g2113.h"
#include "msp430g2113_symbols.h"

#elif defined (__MSP430G2213__)
#include "msp430g2213.h"
#include "msp430g2213_symbols.h"

#elif defined (__MSP430G2313__)
#include "msp430g2313.h"
#include "msp430g2313_symbols.h"

#elif defined (__MSP430G2413__)
#include "msp430g2413.h"
#include "msp430g2413_symbols.h"

#elif defined (__MSP430G2513__)
#include "msp430g2513.h"
#include "msp430g2513_symbols.h"

#elif defined (__MSP430G2153__)
#include "msp430g2153.h"
#include "msp430g2153_symbols.h"

#elif defined (__MSP430G2253__)
#include "msp430g2253.h"
#include "msp430g2253_symbols.h"

#elif defined (__MSP430G2353__)
#include "msp430g2353.h"
#include "msp430g2353_symbols.h"

#elif defined (__MSP430G2453__)
#include "msp430g2453.h"
#include "msp430g2453_symbols.h"

#elif defined (__MSP430G2553__)
#include "msp430g2553.h"
#include "msp430g2553_symbols.h"

#elif defined (__MSP430G2203__)
#include "msp430g2203.h"
#include "msp430g2203_symbols.h"

#elif defined (__MSP430G2303__)
#include "msp430g2303.h"
#include "msp430g2303_symbols.h"

#elif defined (__MSP430G2403__)
#include "msp430g2403.h"
#include "msp430g2403_symbols.h"

#elif defined (__MSP430G2233__)
#include "msp430g2233.h"
#include "msp430g2233_symbols.h"

#elif defined (__MSP430G2333__)
#include "msp430g2333.h"
#include "msp430g2333_symbols.h"

#elif defined (__MSP430G2433__)
#include "msp430g2433.h"
#include "msp430g2433_symbols.h"

#elif defined (__MSP430G2533__)
#include "msp430g2533.h"
#include "msp430g2533_symbols.h"

#elif defined (__MSP430TCH5E__)
#include "msp430tch5e.h"
#include "msp430tch5e_symbols.h"

#elif defined (__MSP430G2444__)
#include "msp430g2444.h"
#include "msp430g2444_symbols.h"

#elif defined (__MSP430G2544__)
#include "msp430g2544.h"
#include "msp430g2544_symbols.h"

#elif defined (__MSP430G2744__)
#include "msp430g2744.h"
#include "msp430g2744_symbols.h"

#elif defined (__MSP430G2755__)
#include "msp430g2755.h"
#include "msp430g2755_symbols.h"

#elif defined (__MSP430G2855__)
#include "msp430g2855.h"
#include "msp430g2855_symbols.h"

#elif defined (__MSP430G2955__)
#include "msp430g2955.h"
#include "msp430g2955_symbols.h"

#elif defined (__MSP430G2230__)
#include "msp430g2230.h"
#include "msp430g2230_symbols.h"

#elif defined (__MSP430G2210__)
#include "msp430g2210.h"
#include "msp430g2210_symbols.h"

#elif defined (__MSP430BT5190__)
#include "msp430bt5190.h"
#include "msp430bt5190_symbols.h"

#elif defined (__MSP430FR5857__)
#include "msp430fr5857.h"
#include "msp430fr5857_symbols.h"

#elif defined (__MSP430FR5858__)
#include "msp430fr5858.h"
#include "msp430fr5858_symbols.h"

#elif defined (__MSP430FR5859__)
#include "msp430fr5859.h"
#include "msp430fr5859_symbols.h"

#elif defined (__MSP430FR5847__)
#include "msp430fr5847.h"
#include "msp430fr5847_symbols.h"

#elif defined (__MSP430FR58471__)
#include "msp430fr58471.h"
#include "msp430fr58471_symbols.h"

#elif defined (__MSP430FR5848__)
#include "msp430fr5848.h"
#include "msp430fr5848_symbols.h"

#elif defined (__MSP430FR5849__)
#include "msp430fr5849.h"
#include "msp430fr5849_symbols.h"

#elif defined (__MSP430FR5867__)
#include "msp430fr5867.h"
#include "msp430fr5867_symbols.h"

#elif defined (__MSP430FR58671__)
#include "msp430fr58671.h"
#include "msp430fr58671_symbols.h"

#elif defined (__MSP430FR5868__)
#include "msp430fr5868.h"
#include "msp430fr5868_symbols.h"

#elif defined (__MSP430FR5869__)
#include "msp430fr5869.h"
#include "msp430fr5869_symbols.h"

#elif defined (__MSP430FR5957__)
#include "msp430fr5957.h"
#include "msp430fr5957_symbols.h"

#elif defined (__MSP430FR5958__)
#include "msp430fr5958.h"
#include "msp430fr5958_symbols.h"

#elif defined (__MSP430FR5959__)
#include "msp430fr5959.h"
#include "msp430fr5959_symbols.h"

#elif defined (__MSP430FR5947__)
#include "msp430fr5947.h"
#include "msp430fr5947_symbols.h"

#elif defined (__MSP430FR59471__)
#include "msp430fr59471.h"
#include "msp430fr59471_symbols.h"

#elif defined (__MSP430FR5948__)
#include "msp430fr5948.h"
#include "msp430fr5948_symbols.h"

#elif defined (__MSP430FR5949__)
#include "msp430fr5949.h"
#include "msp430fr5949_symbols.h"

#elif defined (__MSP430FR5967__)
#include "msp430fr5967.h"
#include "msp430fr5967_symbols.h"

#elif defined (__MSP430FR5968__)
#include "msp430fr5968.h"
#include "msp430fr5968_symbols.h"

#elif defined (__MSP430FR5969__)
#include "msp430fr5969.h"
#include "msp430fr5969_symbols.h"

#elif defined (__MSP430FR59691__)
#include "msp430fr59691.h"
#include "msp430fr59691_symbols.h"

#elif defined (__MSP430FR5962__)
#include "msp430fr5962.h"
#include "msp430fr5962_symbols.h"

#elif defined (__MSP430FR5964__)
#include "msp430fr5964.h"
#include "msp430fr5964_symbols.h"

#elif defined (__MSP430FR5992__)
#include "msp430fr5992.h"
#include "msp430fr5992_symbols.h"

#elif defined (__MSP430FR5994__)
#include "msp430fr5994.h"
#include "msp430fr5994_symbols.h"

#elif defined (__MSP430FR59941__)
#include "msp430fr59941.h"
#include "msp430fr59941_symbols.h"

#elif defined (__MSP430i2020__)
#include "msp430i2020.h"
#include "msp430i2020_symbols.h"

#elif defined (__MSP430i2021__)
#include "msp430i2021.h"
#include "msp430i2021_symbols.h"

#elif defined (__MSP430i2030__)
#include "msp430i2030.h"
#include "msp430i2030_symbols.h"

#elif defined (__MSP430i2031__)
#include "msp430i2031.h"
#include "msp430i2031_symbols.h"

#elif defined (__MSP430i2040__)
#include "msp430i2040.h"
#include "msp430i2040_symbols.h"

#elif defined (__MSP430i2041__)
#include "msp430i2041.h"
#include "msp430i2041_symbols.h"

#elif defined (__RF430FRL152H__)
#include "rf430frl152h.h"
#include "rf430frl152h_symbols.h"

#elif defined (__RF430FRL153H__)
#include "rf430frl153h.h"
#include "rf430frl153h_symbols.h"

#elif defined (__RF430FRL154H__)
#include "rf430frl154h.h"
#include "rf430frl154h_symbols.h"

