tgtakaoka/tinyos-msp430/tos/chips/msp430-small/gnugcc/msp430mcu.h
#elif defined (__RF430FRL152H_ROM__)
#include "rf430frl152h_rom.h"
#include "rf430frl152h_rom_symbols.h"

#elif defined (__RF430FRL153H_ROM__)
#include "rf430frl153h_rom.h"
#include "rf430frl153h_rom_symbols.h"

#elif defined (__RF430FRL154H_ROM__)
#include "rf430frl154h_rom.h"
#include "rf430frl154h_rom_symbols.h"

#elif defined (__RF430F5175__)
#include "rf430f5175.h"
#include "rf430f5175_symbols.h"

#elif defined (__RF430F5155__)
#include "rf430f5155.h"
#include "rf430f5155_symbols.h"

#elif defined (__RF430F5144__)
#include "rf430f5144.h"
#include "rf430f5144_symbols.h"

#elif defined (__MSP430FR69271__)
#include "msp430fr69271.h"
#include "msp430fr69271_symbols.h"

#elif defined (__MSP430FR68791__)
#include "msp430fr68791.h"
#include "msp430fr68791_symbols.h"

#elif defined (__MSP430FR69791__)
#include "msp430fr69791.h"
#include "msp430fr69791_symbols.h"

#elif defined (__MSP430FR6927__)
#include "msp430fr6927.h"
#include "msp430fr6927_symbols.h"

#elif defined (__MSP430FR6928__)
#include "msp430fr6928.h"
#include "msp430fr6928_symbols.h"

#elif defined (__MSP430FR6877__)
#include "msp430fr6877.h"
#include "msp430fr6877_symbols.h"

#elif defined (__MSP430FR6977__)
#include "msp430fr6977.h"
#include "msp430fr6977_symbols.h"

#elif defined (__MSP430FR6879__)
#include "msp430fr6879.h"
#include "msp430fr6879_symbols.h"

#elif defined (__MSP430FR6979__)
#include "msp430fr6979.h"
#include "msp430fr6979_symbols.h"

#elif defined (__MSP430FR58891__)
#include "msp430fr58891.h"
#include "msp430fr58891_symbols.h"

#elif defined (__MSP430FR68891__)
#include "msp430fr68891.h"
#include "msp430fr68891_symbols.h"

#elif defined (__MSP430FR59891__)
#include "msp430fr59891.h"
#include "msp430fr59891_symbols.h"

#elif defined (__MSP430FR69891__)
#include "msp430fr69891.h"
#include "msp430fr69891_symbols.h"

#elif defined (__MSP430FR5887__)
#include "msp430fr5887.h"
#include "msp430fr5887_symbols.h"

#elif defined (__MSP430FR5888__)
#include "msp430fr5888.h"
#include "msp430fr5888_symbols.h"

#elif defined (__MSP430FR5889__)
#include "msp430fr5889.h"
#include "msp430fr5889_symbols.h"

#elif defined (__MSP430FR6887__)
#include "msp430fr6887.h"
#include "msp430fr6887_symbols.h"

#elif defined (__MSP430FR6888__)
#include "msp430fr6888.h"
#include "msp430fr6888_symbols.h"

#elif defined (__MSP430FR6889__)
#include "msp430fr6889.h"
#include "msp430fr6889_symbols.h"

#elif defined (__MSP430FR5986__)
#include "msp430fr5986.h"
#include "msp430fr5986_symbols.h"

#elif defined (__MSP430FR5987__)
#include "msp430fr5987.h"
#include "msp430fr5987_symbols.h"

#elif defined (__MSP430FR5988__)
#include "msp430fr5988.h"
#include "msp430fr5988_symbols.h"

#elif defined (__MSP430FR5989__)
#include "msp430fr5989.h"
#include "msp430fr5989_symbols.h"

#elif defined (__MSP430FR6987__)
#include "msp430fr6987.h"
#include "msp430fr6987_symbols.h"

#elif defined (__MSP430FR6988__)
#include "msp430fr6988.h"
#include "msp430fr6988_symbols.h"

#elif defined (__MSP430FR6989__)
#include "msp430fr6989.h"
#include "msp430fr6989_symbols.h"

#elif defined (__MSP430FR5922__)
#include "msp430fr5922.h"
#include "msp430fr5922_symbols.h"

#elif defined (__MSP430FR5870__)
#include "msp430fr5870.h"
#include "msp430fr5870_symbols.h"

#elif defined (__MSP430FR5970__)
#include "msp430fr5970.h"
#include "msp430fr5970_symbols.h"

#elif defined (__MSP430FR5872__)
#include "msp430fr5872.h"
#include "msp430fr5872_symbols.h"

#elif defined (__MSP430FR5972__)
#include "msp430fr5972.h"
#include "msp430fr5972_symbols.h"

#elif defined (__MSP430FR6820__)
#include "msp430fr6820.h"
#include "msp430fr6820_symbols.h"

#elif defined (__MSP430FR6920__)
#include "msp430fr6920.h"
#include "msp430fr6920_symbols.h"

#elif defined (__MSP430FR6822__)
#include "msp430fr6822.h"
#include "msp430fr6822_symbols.h"

#elif defined (__MSP430FR6922__)
#include "msp430fr6922.h"
#include "msp430fr6922_symbols.h"

#elif defined (__MSP430FR6870__)
#include "msp430fr6870.h"
#include "msp430fr6870_symbols.h"

#elif defined (__MSP430FR6970__)
#include "msp430fr6970.h"
#include "msp430fr6970_symbols.h"

#elif defined (__MSP430FR6872__)
#include "msp430fr6872.h"
#include "msp430fr6872_symbols.h"

#elif defined (__MSP430FR6972__)
#include "msp430fr6972.h"
#include "msp430fr6972_symbols.h"

#elif defined (__MSP430FR59221__)
#include "msp430fr59221.h"
#include "msp430fr59221_symbols.h"

#elif defined (__MSP430FR58721__)
#include "msp430fr58721.h"
#include "msp430fr58721_symbols.h"

#elif defined (__MSP430FR59721__)
#include "msp430fr59721.h"
#include "msp430fr59721_symbols.h"

#elif defined (__MSP430FR68221__)
#include "msp430fr68221.h"
#include "msp430fr68221_symbols.h"

#elif defined (__MSP430FR69221__)
#include "msp430fr69221.h"
#include "msp430fr69221_symbols.h"

#elif defined (__MSP430FR68721__)
#include "msp430fr68721.h"
#include "msp430fr68721_symbols.h"

#elif defined (__MSP430FR69721__)
#include "msp430fr69721.h"
#include "msp430fr69721_symbols.h"

#elif defined (__MSP430SL5438A__)
#include "msp430sl5438a.h"
#include "msp430sl5438a_symbols.h"

#elif defined (__MSP430FR4131__)
#include "msp430fr4131.h"
#include "msp430fr4131_symbols.h"

#elif defined (__MSP430FR4132__)
#include "msp430fr4132.h"
#include "msp430fr4132_symbols.h"

#elif defined (__MSP430FR4133__)
#include "msp430fr4133.h"
#include "msp430fr4133_symbols.h"

#elif defined (__MSP430FR2032__)
#include "msp430fr2032.h"
#include "msp430fr2032_symbols.h"

#elif defined (__MSP430FR2033__)
#include "msp430fr2033.h"
#include "msp430fr2033_symbols.h"

#elif defined (__MSP430FR2000__)
#include "msp430fr2000.h"
#include "msp430fr2000_symbols.h"

#elif defined (__MSP430FR2100__)
#include "msp430fr2100.h"
#include "msp430fr2100_symbols.h"

#elif defined (__MSP430FR2110__)
#include "msp430fr2110.h"
#include "msp430fr2110_symbols.h"

#elif defined (__MSP430FR2111__)
#include "msp430fr2111.h"
#include "msp430fr2111_symbols.h"

