tgtakaoka/tinyos-msp430/tos/chips/msp430-small/gnugcc/msp430mcu.h
#elif defined (__MSP430FR2310__)
#include "msp430fr2310.h"
#include "msp430fr2310_symbols.h"

#elif defined (__MSP430FR2311__)
#include "msp430fr2311.h"
#include "msp430fr2311_symbols.h"

#elif defined (__MSP430FR2422__)
#include "msp430fr2422.h"
#include "msp430fr2422_symbols.h"

#elif defined (__MSP430FR2433__)
#include "msp430fr2433.h"
#include "msp430fr2433_symbols.h"

#elif defined (__MSP430FR2512__)
#include "msp430fr2512.h"
#include "msp430fr2512_symbols.h"

#elif defined (__MSP430FR2522__)
#include "msp430fr2522.h"
#include "msp430fr2522_symbols.h"

#elif defined (__MSP430FR2532__)
#include "msp430fr2532.h"
#include "msp430fr2532_symbols.h"

#elif defined (__MSP430FR2533__)
#include "msp430fr2533.h"
#include "msp430fr2533_symbols.h"

#elif defined (__MSP430FR2632__)
#include "msp430fr2632.h"
#include "msp430fr2632_symbols.h"

#elif defined (__MSP430FR2633__)
#include "msp430fr2633.h"
#include "msp430fr2633_symbols.h"

#elif defined (__MSP430F5252__)
#include "msp430f5252.h"
#include "msp430f5252_symbols.h"

#elif defined (__MSP430F5253__)
#include "msp430f5253.h"
#include "msp430f5253_symbols.h"

#elif defined (__MSP430F5254__)
#include "msp430f5254.h"
#include "msp430f5254_symbols.h"

#elif defined (__MSP430F5255__)
#include "msp430f5255.h"
#include "msp430f5255_symbols.h"

#elif defined (__MSP430F5256__)
#include "msp430f5256.h"
#include "msp430f5256_symbols.h"

#elif defined (__MSP430F5257__)
#include "msp430f5257.h"
#include "msp430f5257_symbols.h"

#elif defined (__MSP430F5258__)
#include "msp430f5258.h"
#include "msp430f5258_symbols.h"

#elif defined (__MSP430F5259__)
#include "msp430f5259.h"
#include "msp430f5259_symbols.h"

#elif defined (__MSP430FR6035__)
#include "msp430fr6035.h"
#include "msp430fr6035_symbols.h"

#elif defined (__MSP430FR6037__)
#include "msp430fr6037.h"
#include "msp430fr6037_symbols.h"

#elif defined (__MSP430FR60371__)
#include "msp430fr60371.h"
#include "msp430fr60371_symbols.h"

#elif defined (__MSP430FR6045__)
#include "msp430fr6045.h"
#include "msp430fr6045_symbols.h"

#elif defined (__MSP430FR6047__)
#include "msp430fr6047.h"
#include "msp430fr6047_symbols.h"

#elif defined (__MSP430FR60471__)
#include "msp430fr60471.h"
#include "msp430fr60471_symbols.h"

#elif defined (__MSP430XGENERIC__)
#include "msp430xgeneric.h"
#include "msp430xgeneric_symbols.h"

#elif defined (__MSP430F5XX_6XXGENERIC__)
#include "msp430f5xx_6xxgeneric.h"
#include "msp430f5xx_6xxgeneric_symbols.h"

#elif defined (__MSP430FR5XX_6XXGENERIC__)
#include "msp430fr5xx_6xxgeneric.h"
#include "msp430fr5xx_6xxgeneric_symbols.h"

#elif defined (__MSP430FR2XX_4XXGENERIC__)
#include "msp430fr2xx_4xxgeneric.h"
#include "msp430fr2xx_4xxgeneric_symbols.h"

#elif defined (__MSP430FR57XXGENERIC__)
#include "msp430fr57xxgeneric.h"
#include "msp430fr57xxgeneric_symbols.h"

#elif defined (__MSP430I2XXGENERIC__)
#include "msp430i2xxgeneric.h"
#include "msp430i2xxgeneric_symbols.h"

/********************************************************************
 *  msp430 generic
 ********************************************************************/
#elif defined (__MSP430GENERIC__)
#error "msp430 generic device does not have a default include file"

#elif defined (__MSP430XGENERIC__)
#error "msp430X generic device does not have a default include file"


/********************************************************************
 *
 ********************************************************************/
#else
#error "Failed to match a default include file"
#endif

#endif /* #ifndef __msp430 */

